In [10]:
#Фруктин Артём РТ5-61Б
# Задача №3.
# Для заданного набора данных произведите масштабирование данных 
# (для одного признака) и преобразование категориальных признаков 
# в количественные двумя способами (label encoding, one hot encoding) для одного признака. 
# Какие методы Вы использовали для решения задачи и почему?

In [11]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import MinMaxScaler, LabelEncoder

In [12]:
data = pd.read_csv('toy_dataset.csv')

In [13]:
data.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [14]:
data.shape

(150000, 6)

In [15]:
data.isna().sum()

Number     0
City       0
Gender     0
Age        0
Income     0
Illness    0
dtype: int64

кодируем ohе. так как значения всего 2, это оптимально

In [16]:
data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
data = pd.get_dummies(data, columns=['Gender'])

In [18]:
data.head()

   Number    City  Age   Income Illness  Gender_Female  Gender_Male
0       1  Dallas   41  40367.0      No          False         True
1       2  Dallas   54  45084.0      No          False         True
2       3  Dallas   42  52483.0      No          False         True
3       4  Dallas   40  40941.0      No          False         True
4       5  Dallas   46  50289.0      No          False         True

Кодируем лэйбл энкодером. Это не оптимальный способ, так как значения разные и могут на порядок отличаться, из-за этого могут появиться ложные зависимости в данных, так как при обучении модели будут больше влиять бОльшие значения

In [19]:
np.unique(data['City'])

array(['Austin', 'Boston', 'Dallas', 'Los Angeles', 'Mountain View',
       'New York City', 'San Diego', 'Washington D.C.'], dtype=object)

In [20]:
city_column = LabelEncoder().fit_transform(data['City'])
np.unique(city_column)

array([0, 1, 2, 3, 4, 5, 6, 7])

Отшкалируем данные в промежуток от 0 до 1. Это важно, потому что модель будет работать с данными в небольшом промежутке, и будет делать лучшие предсказания.

In [21]:
scaler = MinMaxScaler()

In [22]:
data[['Income']] = scaler.fit_transform(data[['Income']])

In [23]:
data.head()

   Number    City  Age    Income Illness  Gender_Female  Gender_Male
0       1  Dallas   41  0.230700      No          False         True
1       2  Dallas   54  0.257228      No          False         True
2       3  Dallas   42  0.298840      No          False         True
3       4  Dallas   40  0.233928      No          False         True
4       5  Dallas   46  0.286501      No          False         True